In [198]:
import pandas as pd
import numpy as np

In [206]:
#Kinda looks like a struct right?
df = pd.DataFrame(
        [["Jan", 1, 1990],
        ["Dec", 25, 1991],
        ["Oct", 31, 1992],
        ["Nov", 27, 1993]],
        index=[0,1,2,3],
        columns=["Month", "Day", "Year"])
df #Rows,Indeces,Columns

  Month  Day  Year
0   Jan    1  1990
1   Dec   25  1991
2   Oct   31  1992
3   Nov   27  1993

In [192]:
df[["Month"]]                      #Summons a column

  Month
0   Jan
1   Dec
2   Oct
3   Nov

In [193]:
df.dtypes

Month    object
Day       int64
Year      int64
dtype: object

In [194]:
df.describe()

            Day         Year
count   4.00000     4.000000
mean   21.00000  1991.500000
std    13.56466     1.290994
min     1.00000  1990.000000
25%    19.00000  1990.750000
50%    26.00000  1991.500000
75%    28.00000  1992.250000
max    31.00000  1993.000000

In [210]:
df.sort_values(by="Day", ascending=False)   #Sorts from highest value fo day to lowest

  Month  Day  Year
2   Oct   31  1992
3   Nov   27  1993
1   Dec   25  1991
0   Jan    1  1990

In [208]:
df[["Month", "Day"]]         #Splices columns

  Month  Day
0   Jan    1
1   Dec   25
2   Oct   31
3   Nov   27

In [212]:
df[0:2]                   #Splices rows

  Month  Day  Year
0   Jan    1  1990
1   Dec   25  1991

In [138]:
df.loc[0:2, ["Month"]]     #Use loc when you need to splice from the table. 
                           #In this example you only grab the Month from rows 0-2

  Month
0   Jan
1   Dec
2   Oct

In [139]:
df.iloc[0:2, [0]]        #Now instead of using the name of the columns, you use their index. 0 is the index of month.
                         #See how loc includes 2 and iloc excludes 2? Remember.

  Month
0   Jan
1   Dec

In [140]:
df.iloc[0:2, [0, 2]]    #Another example

  Month  Year
0   Jan  1990
1   Dec  1991

In [141]:
df.loc[1,["Day"]]      #For some reason, you get more formmatting when you put the column inside a list
                       #You spliced a scalar value.

Day    25
Name: 1, dtype: object

In [142]:
df.loc[1,"Day"]

25

In [143]:
df[df["Year"] > 1991]  #Returns only years that are greater than 1991
                       #See how this code makes a new dataframe?

  Month  Day  Year
2   Oct   31  1992
3   Nov   27  1993

In [144]:
df[df["Month"].isin(["Dec", "Jan"])] #Creates a new dataframe with only the months dec and jan

  Month  Day  Year
0   Jan    1  1990
1   Dec   25  1991

In [145]:
df.loc[1, ["Day"]] = 24
df

  Month  Day  Year
0   Jan    1  1990
1   Dec   24  1991
2   Oct   31  1992
3   Nov   27  1993

In [146]:
df.loc[1, ["Year"]] = np.nan
df

  Month  Day    Year
0   Jan    1  1990.0
1   Dec   24     NaN
2   Oct   31  1992.0
3   Nov   27  1993.0

In [147]:
df.loc[:, ["Day"]] = 5
df

  Month  Day    Year
0   Jan    5  1990.0
1   Dec    5     NaN
2   Oct    5  1992.0
3   Nov    5  1993.0

In [148]:
df["Name"] = ["Corey", "Cat", "Mom", "Lita"]   #Inserted a new column
df

  Month  Day    Year   Name
0   Jan    5  1990.0  Corey
1   Dec    5     NaN    Cat
2   Oct    5  1992.0    Mom
3   Nov    5  1993.0   Lita

In [149]:
df.rename(columns={"Name":"Person"}, inplace=True)        #Renames a column. Keeps same dataFrame with inplace=True
df

  Month  Day    Year Person
0   Jan    5  1990.0  Corey
1   Dec    5     NaN    Cat
2   Oct    5  1992.0    Mom
3   Nov    5  1993.0   Lita

In [150]:
df.columns=["C","O","R","E"]             #Renames multiple columns
df

     C  O       R      E
0  Jan  5  1990.0  Corey
1  Dec  5     NaN    Cat
2  Oct  5  1992.0    Mom
3  Nov  5  1993.0   Lita

In [151]:
df = pd.DataFrame(
        [["Jan", 1, 1990],
        ["Dec", 25, 1991],
        ["Oct", 31, 1992],
        ["Nov", 27, 1993]],
        index=[0,1,2,3],
        columns=["Month", "Day", "Year"])
df #Rows,Indeces,Columns

  Month  Day  Year
0   Jan    1  1990
1   Dec   25  1991
2   Oct   31  1992
3   Nov   27  1993

In [152]:
df.pivot(index="Month", columns="Day", values="Year")  #Reashapes dataframe

Day        1       25      27      31
Month
Dec       NaN  1991.0     NaN     NaN
Jan    1990.0     NaN     NaN     NaN
Nov       NaN     NaN  1993.0     NaN
Oct       NaN     NaN     NaN  1992.0

In [154]:
df.set_index("Year", inplace=True)             #Changes index (aka row label)
df

      Day
Year
1990    1
1991   25
1992   31
1993   27

In [161]:
df1 = pd.DataFrame(
        [["Jan", 1, 1990],
        ["Dec", 25, 1991],
        ["Oct", 31, 1992],
        ["Nov", 27, 1993]],
        index=[0,1,2,3],
        columns=["Month", "Day", "Year"])

In [176]:
df2 = pd.DataFrame(
        [["Sum",  199990],
        ["Fall", 1543991],
        ["Spring",  1434992],
        ["Win", 1994533]],

        index=[0,1,2,3],
        columns=["Season",  "num"])

In [177]:
pd.merge(left=df1, right=df2,                                     
        left_index=True, right_index=True)

  Month  Day  Year  Season      num
0   Jan    1  1990     Sum   199990
1   Dec   25  1991    Fall  1543991
2   Oct   31  1992  Spring  1434992
3   Nov   27  1993     Win  1994533